In [1]:
import pandas as pd
import numpy as np

In [2]:
train = pd.read_csv("/content/Train_aBjfeNk.csv")
test = pd.read_csv("/content/Test_LqhgPWU.csv")
train_Original = train.copy()
test_Original = test.copy()

In [3]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               8068 non-null   int64
 1   Gender           8068 non-null   object
 2   Ever_Married     7928 non-null   object
 3   Age              8068 non-null   int64
 4   Graduated        7990 non-null   object
 5   Profession       7944 non-null   object
 6   Work_Experience  7239 non-null   float64
 7   Spending_Score   8068 non-null   object
 8   Family_Size      7733 non-null   float64
 9   Var_1            7992 non-null   object
 10  Segmentation     8068 non-null   object
dtypes: float64(2), int64(2), object(7)
memory usage: 693.5+ KB

In [4]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2627 entries, 0 to 2626
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               2627 non-null   int64
 1   Gender           2627 non-null   object
 2   Ever_Married     2577 non-null   object
 3   Age              2627 non-null   int64
 4   Graduated        2603 non-null   object
 5   Profession       2589 non-null   object
 6   Work_Experience  2358 non-null   float64
 7   Spending_Score   2627 non-null   object
 8   Family_Size      2514 non-null   float64
 9   Var_1            2595 non-null   object
dtypes: float64(2), int64(2), object(6)
memory usage: 205.4+ KB

In [5]:
train.isnull().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
Segmentation         0
dtype: int64

In [6]:
test.isnull().sum()

ID                   0
Gender               0
Ever_Married        50
Age                  0
Graduated           24
Profession          38
Work_Experience    269
Spending_Score       0
Family_Size        113
Var_1               32
dtype: int64

In [7]:
train.head(5)

       ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809    Male           No  ...          4.0  Cat_4            D
1  462643  Female          Yes  ...          3.0  Cat_4            A
2  466315  Female          Yes  ...          1.0  Cat_6            B
3  461735    Male          Yes  ...          2.0  Cat_6            B
4  462669  Female          Yes  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [8]:
test.head(5)

       ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0  458989  Female          Yes  ...             Low         1.0  Cat_6
1  458994    Male          Yes  ...         Average         4.0  Cat_6
2  458996  Female          Yes  ...             Low         1.0  Cat_6
3  459000    Male          Yes  ...            High         2.0  Cat_6
4  459001  Female           No  ...             Low         4.0  Cat_6

[5 rows x 10 columns]

In [9]:
columns_train = ['Gender','Ever_Married','Age','Graduated','Profession','Work_Experience','Spending_Score','Family_Size','Var_1']

In [10]:
Target_col = train.Segmentation

In [11]:
Target_col = Target_col.replace('A',1).replace('B',2).replace('C',3).replace('D',4)

In [12]:
train = train[columns_train]
test = test[columns_train]

In [13]:
train['Gender'].value_counts()

Male      4417
Female    3651
Name: Gender, dtype: int64

In [14]:
train.head(15)

    Gender Ever_Married  Age  ... Spending_Score Family_Size  Var_1
0     Male           No   22  ...            Low         4.0  Cat_4
1   Female          Yes   38  ...        Average         3.0  Cat_4
2   Female          Yes   67  ...            Low         1.0  Cat_6
3     Male          Yes   67  ...           High         2.0  Cat_6
4   Female          Yes   40  ...           High         6.0  Cat_6
5     Male          Yes   56  ...        Average         2.0  Cat_6
6     Male           No   32  ...            Low         3.0  Cat_6
7   Female           No   33  ...            Low         3.0  Cat_6
8   Female          Yes   61  ...            Low         3.0  Cat_7
9   Female          Yes   55  ...        Average         4.0  Cat_6
10  Female           No   26  ...            Low         3.0  Cat_6
11    Male           No   19  ...            Low         4.0  Cat_4
12  Female           No   19  ...            Low         NaN  Cat_3
13    Male          Yes   70  ...            Low         1.0  Cat_6
14  Female          Yes   58  ...            Low         1.0  Cat_3

[15 rows x 9 columns]

IMPUTATION

In [15]:
train['Ever_Married'] = train['Ever_Married'].fillna(train['Ever_Married'].mode()[0])
test['Ever_Married'] = test['Ever_Married'].fillna(test['Ever_Married'].mode()[0])

In [16]:
# train['Ever_Married'] = train['Ever_Married'].replace('No',0).replace('Yes',1)
train['Graduated'].value_counts()

Yes    4968
No     3022
Name: Graduated, dtype: int64

In [17]:
train['Graduated'] = train['Graduated'].fillna(train['Graduated'].mode()[0])
test['Graduated'] = test['Graduated'].fillna(test['Graduated'].mode()[0])

In [18]:
train['Profession'] = train['Profession'].fillna(train['Profession'].mode()[0])
test['Profession'] = test['Profession'].fillna(test['Profession'].mode()[0])

In [19]:
train['Work_Experience'].value_counts()

1.0     2354
0.0     2318
9.0      474
8.0      463
2.0      286
3.0      255
4.0      253
6.0      204
7.0      196
5.0      194
10.0      53
11.0      50
12.0      48
13.0      46
14.0      45
Name: Work_Experience, dtype: int64

In [20]:
train['Work_Experience'] = train['Work_Experience'].fillna(train['Work_Experience'].mode()[0])
test['Work_Experience'] = test['Work_Experience'].fillna(test['Work_Experience'].mode()[0])

In [21]:
train['Var_1'] = train['Var_1'].fillna(train['Var_1'].mode()[0])
test['Var_1'] = test['Var_1'].fillna(test['Var_1'].mode()[0])

In [22]:
train.isnull().sum()

Gender               0
Ever_Married         0
Age                  0
Graduated            0
Profession           0
Work_Experience      0
Spending_Score       0
Family_Size        335
Var_1                0
dtype: int64

In [23]:
train['Family_Size'].value_counts()

2.0    2390
3.0    1497
1.0    1453
4.0    1379
5.0     612
6.0     212
7.0      96
8.0      50
9.0      44
Name: Family_Size, dtype: int64

In [24]:
train['Family_Size'] = train['Family_Size'].fillna(train['Family_Size'].mode()[0])
test['Family_Size'] = test['Family_Size'].fillna(test['Family_Size'].mode()[0])

In [25]:
train.isnull().sum()

Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
dtype: int64

In [26]:
test.isnull().sum()

Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
dtype: int64

In [27]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8068 entries, 0 to 8067
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Gender           8068 non-null   object
 1   Ever_Married     8068 non-null   object
 2   Age              8068 non-null   int64
 3   Graduated        8068 non-null   object
 4   Profession       8068 non-null   object
 5   Work_Experience  8068 non-null   float64
 6   Spending_Score   8068 non-null   object
 7   Family_Size      8068 non-null   float64
 8   Var_1            8068 non-null   object
dtypes: float64(2), int64(1), object(6)
memory usage: 567.4+ KB

TRANSFORMATION

In [28]:
train['Gender'] = train['Gender'].replace('Female',0).replace('Male',1)
test['Gender'] = test['Gender'].replace('Female',0).replace('Male',1)

In [29]:
train['Ever_Married'] = train['Ever_Married'].replace('No',0).replace('Yes',1)
test['Ever_Married'] = test['Ever_Married'].replace('No',0).replace('Yes',1)

In [30]:
train['Graduated'] = train['Graduated'].replace('No',0).replace('Yes',1)
test['Graduated'] = test['Graduated'].replace('No',0).replace('Yes',1)

In [31]:
train['Profession'].value_counts()

Artist           2640
Healthcare       1332
Entertainment     949
Engineer          699
Doctor            688
Lawyer            623
Executive         599
Marketing         292
Homemaker         246
Name: Profession, dtype: int64

In [32]:
train['Profession'] = train['Profession'].replace('Artist',1).replace('Healthcare',2).replace('Entertainment',3).replace('Engineer',4).replace('Doctor',5).replace('Lawyer',6).replace('Executive',7).replace('Marketing',8).replace('Homemaker',9)
test['Profession'] = test['Profession'].replace('Artist',1).replace('Healthcare',2).replace('Entertainment',3).replace('Engineer',4).replace('Doctor',5).replace('Lawyer',6).replace('Executive',7).replace('Marketing',8).replace('Homemaker',9)

In [33]:
train['Spending_Score'].value_counts()

Low        4878
Average    1974
High       1216
Name: Spending_Score, dtype: int64

In [34]:
train['Spending_Score'] = train['Spending_Score'].replace('Low',1).replace('Average',2).replace('High',3)
test['Spending_Score'] = test['Spending_Score'].replace('Low',1).replace('Average',2).replace('High',3)

In [35]:
train['Var_1'].value_counts()

Cat_6    5314
Cat_4    1089
Cat_3     822
Cat_2     422
Cat_7     203
Cat_1     133
Cat_5      85
Name: Var_1, dtype: int64

In [36]:
train['Var_1'] = train['Var_1'].replace('Cat_1',1).replace('Cat_2',2).replace('Cat_3',3).replace('Cat_4',4).replace('Cat_5',5).replace('Cat_6',6).replace('Cat_7',7)
test['Var_1'] = test['Var_1'].replace('Cat_1',1).replace('Cat_2',2).replace('Cat_3',3).replace('Cat_4',4).replace('Cat_5',5).replace('Cat_6',6).replace('Cat_7',7)

In [37]:
train.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       1             0   22  ...               1          4.0      4
1       0             1   38  ...               2          3.0      4
2       0             1   67  ...               1          1.0      6
3       1             1   67  ...               3          2.0      6
4       0             1   40  ...               3          6.0      6

[5 rows x 9 columns]

In [38]:
test.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       0             1   36  ...               1          1.0      6
1       1             1   37  ...               2          4.0      6
2       0             1   69  ...               1          1.0      6
3       1             1   59  ...               3          2.0      6
4       0             0   19  ...               1          4.0      6

[5 rows x 9 columns]

In [39]:
train['Work_Experience'] = train['Work_Experience'].round().astype(int)
test['Work_Experience'] = test['Work_Experience'].round().astype(int)

In [40]:
train['Family_Size'] = train['Family_Size'].round().astype(int)
test['Family_Size'] = test['Family_Size'].round().astype(int)

In [41]:
train.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       1             0   22  ...               1            4      4
1       0             1   38  ...               2            3      4
2       0             1   67  ...               1            1      6
3       1             1   67  ...               3            2      6
4       0             1   40  ...               3            6      6

[5 rows x 9 columns]

In [42]:
test.head()

   Gender  Ever_Married  Age  ...  Spending_Score  Family_Size  Var_1
0       0             1   36  ...               1            1      6
1       1             1   37  ...               2            4      6
2       0             1   69  ...               1            1      6
3       1             1   59  ...               3            2      6
4       0             0   19  ...               1            4      6

[5 rows x 9 columns]

MODEL

In [43]:
from xgboost import XGBClassifier
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [44]:
train_x,valid_x,train_y,valid_y = train_test_split(train,Target_col,test_size = 0.3,random_state = 0)

In [45]:
model = XGBClassifier(random_state=0)
model.fit(train_x,train_y)
pred = model.predict(valid_x)
print(accuracy_score(valid_y,pred))

0.5187938868236266

In [46]:
from sklearn.tree import DecisionTreeRegressor
from sklearn.ensemble import RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.ensemble import RandomForestRegressor

In [47]:
model2 = RandomForestClassifier(random_state=0)
model2.fit(train_x,train_y)
pred2 = model2.predict(valid_x)
print(accuracy_score(valid_y,pred2))

0.47872779843040064

In [48]:
model3 = LogisticRegression()
model3.fit(train_x,train_y)
pred3 = model3.predict(valid_x)
print(accuracy_score(valid_y,pred3))

0.43948781495249895

/usr/local/lib/python3.6/dist-packages/sklearn/linear_model/_logistic.py:940: ConvergenceWarning: lbfgs failed to converge (status=1):
STOP: TOTAL NO. of ITERATIONS REACHED LIMIT.

Increase the number of iterations (max_iter) or scale the data as shown in:
    https://scikit-learn.org/stable/modules/preprocessing.html
Please also refer to the documentation for alternative solver options:
    https://scikit-learn.org/stable/modules/linear_model.html#logistic-regression
  extra_warning_msg=_LOGISTIC_SOLVER_CONVERGENCE_MSG)